uhnp/src/Enums/СпособыВводаЗначенийКритериев/СпособыВводаЗначенийКритериев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаЗначенийКритериев</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>ВыборИзМножества</name>
  </enumValues>
  <enumValues>
    <name>ВводСтроки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/ВыборОбъектовВызовСервераУХ/Module.bsl
Функция НастройкаПроцессаВыбораВладельца(ВладелецОбъектовВыбора, СоздаватьНовуюНастройку=Ложь) Экспорт
	Возврат ВыборОбъектовУХ.НастройкаПроцессаВыбораВладельца(ВладелецОбъектовВыбора, СоздаватьНовуюНастройку);
КонецФункции

Процедура РестартПроцессаВыбора(ВладелецОбъектовВыбора) Экспорт
	ВыборОбъектовУХ.РестартПроцессаВыбора(ВладелецОбъектовВыбора);
КонецПроцедуры

Процедура РассчитатьЗначенияКритериев(ВладелецОбъектовВыбора) Экспорт
	ВыборОбъектовУХ.РассчитатьЗначенияКритериев(ВладелецОбъектовВыбора);
КонецПроцедуры

Функция ПолучитьТипКритерия(КритерийВыбора) Экспорт
	Если ЗначениеЗаполнено(КритерийВыбора) Тогда
		Если КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.ВводСтроки Тогда
			Возврат Тип("Строка");
		ИначеЕсли КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.ВыборИзМножества Тогда
			Возврат Тип("СправочникСсылка.ЗначенияПеречислимыхКритериев");
		ИначеЕсли КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.Число Тогда
			Возврат Тип("Число");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Тип("Неопределено");
КонецФункции

Функция ПолучитьОписаниеТипаКритерия(КритерийВыбора) Экспорт
	Если ЗначениеЗаполнено(КритерийВыбора) Тогда
		Если КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.ВводСтроки Тогда
			Возврат Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1000));
		ИначеЕсли КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.ВыборИзМножества Тогда
			Возврат Новый ОписаниеТипов("СправочникСсылка.ЗначенияПеречислимыхКритериев");
		ИначеЕсли КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.Число Тогда
			Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(16,3,ДопустимыйЗнак.Любой));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Метаданные.ОпределяемыеТипы.ТипЗначенияКритерияОценки.Тип;
КонецФункции

Функция ПолучитьЗначениеПоУмолчаниюКритерия(КритерийВыбора) Экспорт
	Если ЗначениеЗаполнено(КритерийВыбора) Тогда
		Если КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.ВводСтроки Тогда
			Возврат "";
		ИначеЕсли КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.ВыборИзМножества Тогда
			Возврат Справочники.ЗначенияПеречислимыхКритериев.ПустаяСсылка();
		ИначеЕсли КритерийВыбора.СпособВводаЗначения = Перечисления.СпособыВводаЗначенийКритериев.Число Тогда
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Тип("Неопределено");
КонецФункции
